Долома/src/Documents/Отъём/Отъём.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Отъём</name>
  <comment>Отъём телят от матерей</comment>
  <registerRecords>InformationRegister.Взвешивания</registerRecords>
  <registerRecords>InformationRegister.РазмещениеЖивотных</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </attributes>
  <attributes>
    <name>КорпусПеремещения</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Животные</name>
    <attributes>
      <name>Животное</name>
      <type>
        <types>CatalogRef.Животные</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рост</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесРождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийВозраст</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Привес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТриМесяца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Долома/src/InformationRegisters/Взвешивания/Взвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Взвешивания</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <comment>Вес на перевеске (в кг)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Рост</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СреднеСуточныйПривес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТриМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/InformationRegisters/РазмещениеЖивотных/РазмещениеЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЖивотных</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.Корпуса</types>
    </type>
  </resources>
  <resources>
    <name>Ферма</name>
    <type>
      <types>CatalogRef.Фермы</types>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.Животные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Documents/Отъём/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взвешивания.Записывать 		= Истина;
	Движения.РазмещениеЖивотных.Записывать 	= Истина;
	
	Для каждого СтрокаТабличнойЧасти из Животные Цикл
		
		НовоеДвижение = Движения.Взвешивания.Добавить();
		
		НовоеДвижение.Период				= Дата;
		НовоеДвижение.Животное 				= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Вес					= СтрокаТабличнойЧасти.Вес;
		НовоеДвижение.Рост					= СтрокаТабличнойЧасти.Рост;
		НовоеДвижение.ВесТриМесяца			= СтрокаТабличнойЧасти.ВесТриМесяца;
		НовоеДвижение.СреднеСуточныйПривес	= СтрокаТабличнойЧасти.Привес;
		НовоеДвижение.Примечание			= "Отъем теленка " + СтрокаТабличнойЧасти.Примечание;
		
		Если ЗначениеЗаполнено(КорпусПеремещения) Тогда
			НовоеДвижение 					= Движения.РазмещениеЖивотных.Добавить();
			НовоеДвижение.Период 			= Дата;
			НовоеДвижение.Животное 			= СтрокаТабличнойЧасти.Животное;
			НовоеДвижение.Корпус 			= КорпусПеремещения;
			НовоеДвижение.Ферма 			= Ферма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив();
	
	Если Проведен Тогда  
		НепроверяемыеРеквизиты.Добавить("КорпусПеремещения");
	КонецЕсли;
  	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);	
	
КонецПроцедуры
